
# State **`s3://infrahouse-aws-control-493370826424/terraform.tfstate`**
## Affected resources counts

|  Success  |   🟢 Add |   🟡 Change |   🔴 Destroy |
|:---------:|--------:|-----------:|------------:|
|     ✅     |       3 |          1 |           3 |
## Affected resources by action

|  Action  | Resources                                                    |
|:--------:|:-------------------------------------------------------------|
|    🟡     | `module.jumphost.aws_lambda_function.update_dns`             |
|    🟡     | `module.jumphost.null_resource.install_python_dependencies:` |
<details>
<summary>STDOUT</summary>

```[command]/home/runner/work/_temp/5c06c04b-bfb3-44e6-acde-982516f29e43/terraform-bin plan -no-color --out=tf.plan
module.jumphost.null_resource.install_python_dependencies: Refreshing state... [id=1448941761561251015]
module.jumphost.random_uuid.lamda_src_hash: Refreshing state... [id=6961ad18-3555-c96e-0939-8b3071e5a082]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...
aws_key_pair.aleks: Refreshing state... [id=aleks]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Reading...
module.jumphost.data.aws_region.current: Reading...
module.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...
module.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...
module.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]
data.aws_ami.ubuntu_22: Reading...
module.jumphost.aws_s3_bucket.lambda_tmp: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]
module.jumphost.data.aws_caller_identity.current: Reading...
module.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]
module.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=1152265192]
module.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=1903849331]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3894068826]
data.aws_iam_policy.administrator-access: Reading...
module.jumphost.data.aws_iam_policy_document.assume_role: Reading...
data.aws_availability_zones.uw1: Reading...
module.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]
module.jumphost.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3693445097]
module.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...
module.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]
module.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]
module.jumphost.data.aws_ami.ubuntu_22: Reading...
data.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]
module.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost20230710043044761000000002]
module.jumphost.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]
data.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0793452df88d33c63]
module.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001]
module.jumphost.data.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0793452df88d33c63]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]
module.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]
module.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-016035246b49102b5]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]
module.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.jumphost: Refreshing state... [id=jumphost20230710043044761000000002-20230710043045781100000003]
module.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost]
module.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]
module.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]
module.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]
module.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=1382937169]
module.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-01a8ef96822b4b00b]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]
module.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0bc6c44c1b26fed22]
module.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-0cfffaca325d93827]
module.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]
module.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]
module.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]
module.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]
module.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-083e969dc3779af26]
module.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-0178e1718deba51ce]
module.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]
module.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]
module.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]
module.jumphost.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]
module.jumphost.aws_s3_object.lambda_package: Refreshing state... [id=6961ad18-3555-c96e-0939-8b3071e5a082.zip]
module.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]
module.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-08b1cd06b043099ec]
module.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]
module.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]
module.jumphost.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=iam_for_lambda-20230710175434878000000001]
module.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20230710045512165400000001]
module.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-0e795bdaee627aa6c]
module.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-0bf278b6a394aed44]
module.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]
module.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]
module.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]
module.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]
module.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0bc6c44c1b26fed221080289494]
module.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-0178e1718deba51ce1080289494]
module.jumphost.aws_lambda_function.update_dns: Refreshing state... [id=update_dns]
module.jumphost.aws_autoscaling_lifecycle_hook.launching: Refreshing state... [id=launching]
module.jumphost.aws_autoscaling_lifecycle_hook.terminating: Refreshing state... [id=terminating]
module.jumphost.data.aws_iam_policy_document.lambda-permissions: Reading...
module.jumphost.aws_cloudwatch_event_rule.scale: Refreshing state... [id=jumphost-scale20230711172747504700000001]
module.jumphost.data.aws_iam_policy_document.lambda-permissions: Read complete after 0s [id=505280429]
module.jumphost.aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001]
data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]
module.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]
module.jumphost.aws_iam_role_policy_attachment.lambda_permissions: Refreshing state... [id=iam_for_lambda-20230711160513416100000002]
module.jumphost.aws_cloudwatch_log_group.update_dns: Refreshing state... [id=/aws/lambda/update_dns]
module.jumphost.aws_cloudwatch_event_target.scale-out: Refreshing state... [id=jumphost-scale20230711172747504700000001-terraform-20230711172747630900000002]
module.jumphost.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch-out]
module.jumphost.data.aws_iam_policy_document.lambda_logging: Reading...
module.jumphost.data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=2267145382]
module.jumphost.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_logging20230711160513778300000003]
module.jumphost.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20230711160514251100000004]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.jumphost.data.archive_file.lambda will be read during apply
  # (config refers to values not yet known)
 <= data "archive_file" "lambda" {
      + excludes            = [
          + "__pycache__",
        ]
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = (known after apply)
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "modules/jumphost/update_dns"
      + type                = "zip"
    }

  # module.jumphost.aws_lambda_function.update_dns will be updated in-place
  ~ resource "aws_lambda_function" "update_dns" {
        id                             = "update_dns"
      ~ last_modified                  = "2023-07-16T04:30:31.000+0000" -> (known after apply)
      ~ s3_key                         = "6961ad18-3555-c96e-0939-8b3071e5a082.zip" -> (known after apply)
        tags                           = {}
        # (21 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.jumphost.aws_s3_object.lambda_package must be replaced
-/+ resource "aws_s3_object" "lambda_package" {
      ~ bucket_key_enabled     = false -> (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "01edc3b0db6d797cc4e63d67f6aafac7-3" -> (known after apply)
      ~ id                     = "6961ad18-3555-c96e-0939-8b3071e5a082.zip" -> (known after apply)
      ~ key                    = "6961ad18-3555-c96e-0939-8b3071e5a082.zip" # forces replacement -> (known after apply) # forces replacement
      + kms_key_id             = (known after apply)
      - metadata               = {} -> null
      ~ server_side_encryption = "AES256" -> (known after apply)
      ~ source                 = "modules/jumphost/6961ad18-3555-c96e-0939-8b3071e5a082.zip" -> (known after apply)
      ~ storage_class          = "STANDARD" -> (known after apply)
      - tags                   = {} -> null
      + version_id             = (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.jumphost.null_resource.install_python_dependencies must be replaced
-/+ resource "null_resource" "install_python_dependencies" {
      ~ id       = "1448941761561251015" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "main_version"         = "a3522224daf946c40355e468ae2bff48" -> "0d3dff5e338585ee6256665265c9a7c8"
            # (1 unchanged element hidden)
        }
    }

  # module.jumphost.random_uuid.lamda_src_hash must be replaced
-/+ resource "random_uuid" "lamda_src_hash" {
      ~ id      = "6961ad18-3555-c96e-0939-8b3071e5a082" -> (known after apply)
      ~ keepers = { # forces replacement
          ~ "main.py"          = "a3522224daf946c40355e468ae2bff48" -> "0d3dff5e338585ee6256665265c9a7c8"
            # (1 unchanged element hidden)
        }
      ~ result  = "6961ad18-3555-c96e-0939-8b3071e5a082" -> (known after apply)
    }

Plan: 3 to add, 1 to change, 3 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tf.plan

To perform exactly these actions, run the following command to apply:
    terraform apply "tf.plan"
Releasing state lock. This may take a few moments...
::debug::Terraform exited with code 0.
::debug::stdout: module.jumphost.null_resource.install_python_dependencies: Refreshing state... [id=1448941761561251015]%0Amodule.jumphost.random_uuid.lamda_src_hash: Refreshing state... [id=6961ad18-3555-c96e-0939-8b3071e5a082]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Reading...%0Aaws_key_pair.aleks: Refreshing state... [id=aleks]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Reading...%0Amodule.jumphost.data.aws_region.current: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Reading...%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Reading...%0Amodule.management.aws_vpc.vpc: Refreshing state... [id=vpc-08e19d859c26d18b2]%0Adata.aws_ami.ubuntu_22: Reading...%0Amodule.jumphost.aws_s3_bucket.lambda_tmp: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]%0Amodule.jumphost.data.aws_caller_identity.current: Reading...%0Amodule.jumphost.data.aws_region.current: Read complete after 0s [id=us-west-1]%0Amodule.jumphost.data.aws_iam_policy_document.jumphost_permissions: Read complete after 0s [id=1152265192]%0Amodule.jumphost.module.jumphost_profile.data.aws_iam_policy_document.assume: Read complete after 0s [id=1903849331]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-permissions: Read complete after 0s [id=3894068826]%0Adata.aws_iam_policy.administrator-access: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.assume_role: Reading...%0Adata.aws_availability_zones.uw1: Reading...%0Amodule.infrahouse_com.aws_route53_zone.infrahouse_com: Refreshing state... [id=Z07662251LH3YRF2ERM3G]%0Amodule.jumphost.data.aws_iam_policy_document.assume_role: Read complete after 0s [id=3693445097]%0Amodule.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Reading...%0Amodule.jumphost.data.aws_caller_identity.current: Read complete after 0s [id=493370826424]%0Amodule.github-connector.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::493370826424:oidc-provider/token.actions.githubusercontent.com]%0Amodule.jumphost.data.aws_ami.ubuntu_22: Reading...%0Adata.aws_availability_zones.uw1: Read complete after 0s [id=us-west-1]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role.profile: Refreshing state... [id=jumphost20230710043044761000000002]%0Amodule.jumphost.aws_iam_role.iam_for_lambda: Refreshing state... [id=iam_for_lambda]%0Adata.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0793452df88d33c63]%0Amodule.jumphost.module.jumphost_profile.aws_iam_policy.profile: Refreshing state... [id=arn:aws:iam::493370826424:policy/jumphost20230710043044760400000001]%0Amodule.jumphost.data.aws_ami.ubuntu_22: Read complete after 0s [id=ami-0793452df88d33c63]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.github-assume: Read complete after 0s [id=3911844868]%0Amodule.management.aws_eip.nat_eip["10.0.0.0/24"]: Refreshing state... [id=eipalloc-02b42e70d52a5db7f]%0Amodule.management.aws_eip.nat_eip["10.0.2.0/24"]: Refreshing state... [id=eipalloc-016035246b49102b5]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.github: Refreshing state... [id=ih-tf-aws-control-493370826424-github]%0Amodule.jumphost.module.jumphost_profile.aws_iam_role_policy_attachment.jumphost: Refreshing state... [id=jumphost20230710043044761000000002-20230710043045781100000003]%0Amodule.jumphost.module.jumphost_profile.aws_iam_instance_profile.profile: Refreshing state... [id=jumphost]%0Amodule.infrahouse_com.aws_route53_record.spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_SPF]%0Amodule.infrahouse_com.aws_route53_record.txt_dkim: Refreshing state... [id=Z07662251LH3YRF2ERM3G_google._domainkey.infrahouse.com_TXT]%0Amodule.infrahouse_com.aws_route53_record.txt_spf: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_TXT]%0Amodule.infrahouse_com.aws_route53_record.mx: Refreshing state... [id=Z07662251LH3YRF2ERM3G_infrahouse.com_MX]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Reading...%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy_document.admin-assume: Read complete after 0s [id=1382937169]%0Amodule.jumphost.aws_launch_template.jumphost: Refreshing state... [id=lt-01a8ef96822b4b00b]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin]%0Amodule.management.aws_route_table.all["10.0.2.0/24"]: Refreshing state... [id=rtb-0bc6c44c1b26fed22]%0Amodule.management.aws_subnet.all["10.0.3.0/24"]: Refreshing state... [id=subnet-0cfffaca325d93827]%0Amodule.management.aws_internet_gateway.ig: Refreshing state... [id=igw-079090e09ed5db582]%0Amodule.management.aws_default_route_table.default: Refreshing state... [id=rtb-0d73383afeb6ad142]%0Amodule.management.aws_subnet.all["10.0.0.0/24"]: Refreshing state... [id=subnet-0df885dcc99418799]%0Amodule.management.aws_subnet.all["10.0.1.0/24"]: Refreshing state... [id=subnet-0f91dd2675e7a16c3]%0Amodule.management.aws_subnet.all["10.0.2.0/24"]: Refreshing state... [id=subnet-083e969dc3779af26]%0Amodule.management.aws_route_table.all["10.0.3.0/24"]: Refreshing state... [id=rtb-0178e1718deba51ce]%0Amodule.management.aws_route_table.all["10.0.0.0/24"]: Refreshing state... [id=rtb-04a16e74d5b12a338]%0Amodule.management.aws_route_table.all["10.0.1.0/24"]: Refreshing state... [id=rtb-067c30e65dd4108e9]%0Amodule.management.aws_default_security_group.default: Refreshing state... [id=sg-08b960b85f5996100]%0Amodule.jumphost.aws_s3_bucket_public_access_block.public_access: Refreshing state... [id=infrahouse-jumphost-lambda-20230713233459675800000001]%0Amodule.jumphost.aws_s3_object.lambda_package: Refreshing state... [id=6961ad18-3555-c96e-0939-8b3071e5a082.zip]%0Amodule.management.aws_route.default_main: Refreshing state... [id=r-rtb-0d73383afeb6ad1421080289494]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.2.0/24"]: Refreshing state... [id=nat-08b1cd06b043099ec]%0Amodule.management.aws_nat_gateway.nat_gw["10.0.0.0/24"]: Refreshing state... [id=nat-08fb9b52683277947]%0Amodule.jumphost.data.aws_iam_policy.AWSLambdaBasicExecutionRole: Read complete after 1s [id=arn:aws:iam::aws:policy/service-role/AWSLambdaBasicExecutionRole]%0Amodule.jumphost.aws_iam_role_policy_attachment.AWSLambdaBasicExecutionRole: Refreshing state... [id=iam_for_lambda-20230710175434878000000001]%0Amodule.jumphost.aws_autoscaling_group.jumphost: Refreshing state... [id=jumphost-20230710045512165400000001]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.2.0/24"]: Refreshing state... [id=rtbassoc-0e795bdaee627aa6c]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.3.0/24"]: Refreshing state... [id=rtbassoc-0bf278b6a394aed44]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.0.0/24"]: Refreshing state... [id=rtbassoc-08a410160e2dcc592]%0Amodule.management.aws_route_table_association.private_rt_assoc["10.0.1.0/24"]: Refreshing state... [id=rtbassoc-099b958af19485f2b]%0Amodule.management.aws_route.subnet_public["10.0.0.0/24"]: Refreshing state... [id=r-rtb-04a16e74d5b12a3381080289494]%0Amodule.management.aws_route.subnet_private["10.0.1.0/24"]: Refreshing state... [id=r-rtb-067c30e65dd4108e91080289494]%0Amodule.management.aws_route.subnet_public["10.0.2.0/24"]: Refreshing state... [id=r-rtb-0bc6c44c1b26fed221080289494]%0Amodule.management.aws_route.subnet_private["10.0.3.0/24"]: Refreshing state... [id=r-rtb-0178e1718deba51ce1080289494]%0Amodule.jumphost.aws_lambda_function.update_dns: Refreshing state... [id=update_dns]%0Amodule.jumphost.aws_autoscaling_lifecycle_hook.launching: Refreshing state... [id=launching]%0Amodule.jumphost.aws_autoscaling_lifecycle_hook.terminating: Refreshing state... [id=terminating]%0Amodule.jumphost.data.aws_iam_policy_document.lambda-permissions: Reading...%0Amodule.jumphost.aws_cloudwatch_event_rule.scale: Refreshing state... [id=jumphost-scale20230711172747504700000001]%0Amodule.jumphost.data.aws_iam_policy_document.lambda-permissions: Read complete after 0s [id=505280429]%0Amodule.jumphost.aws_iam_policy.lambda_permissions: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_permissions20230711160512724200000001]%0Adata.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-493370826424-admin.data.aws_iam_policy.administrator-access: Read complete after 2s [id=arn:aws:iam::aws:policy/AdministratorAccess]%0Amodule.ih-tf-aws-control-493370826424-admin.aws_iam_role_policy_attachment.admin: Refreshing state... [id=ih-tf-aws-control-493370826424-admin-20230709164321319900000001]%0Amodule.jumphost.aws_iam_role_policy_attachment.lambda_permissions: Refreshing state... [id=iam_for_lambda-20230711160513416100000002]%0Amodule.jumphost.aws_cloudwatch_log_group.update_dns: Refreshing state... [id=/aws/lambda/update_dns]%0Amodule.jumphost.aws_cloudwatch_event_target.scale-out: Refreshing state... [id=jumphost-scale20230711172747504700000001-terraform-20230711172747630900000002]%0Amodule.jumphost.aws_lambda_permission.allow_cloudwatch: Refreshing state... [id=AllowExecutionFromCloudWatch-out]%0Amodule.jumphost.data.aws_iam_policy_document.lambda_logging: Reading...%0Amodule.jumphost.data.aws_iam_policy_document.lambda_logging: Read complete after 0s [id=2267145382]%0Amodule.jumphost.aws_iam_policy.lambda_logging: Refreshing state... [id=arn:aws:iam::493370826424:policy/lambda_logging20230711160513778300000003]%0Amodule.jumphost.aws_iam_role_policy_attachment.lambda_logs: Refreshing state... [id=iam_for_lambda-20230711160514251100000004]%0A%0ATerraform used the selected providers to generate the following execution%0Aplan. Resource actions are indicated with the following symbols:%0A  ~ update in-place%0A-/+ destroy and then create replacement%0A <= read (data resources)%0A%0ATerraform will perform the following actions:%0A%0A  # module.jumphost.data.archive_file.lambda will be read during apply%0A  # (config refers to values not yet known)%0A <= data "archive_file" "lambda" {%0A      + excludes            = [%0A          + "__pycache__",%0A        ]%0A      + id                  = (known after apply)%0A      + output_base64sha256 = (known after apply)%0A      + output_base64sha512 = (known after apply)%0A      + output_md5          = (known after apply)%0A      + output_path         = (known after apply)%0A      + output_sha          = (known after apply)%0A      + output_sha256       = (known after apply)%0A      + output_sha512       = (known after apply)%0A      + output_size         = (known after apply)%0A      + source_dir          = "modules/jumphost/update_dns"%0A      + type                = "zip"%0A    }%0A%0A  # module.jumphost.aws_lambda_function.update_dns will be updated in-place%0A  ~ resource "aws_lambda_function" "update_dns" {%0A        id                             = "update_dns"%0A      ~ last_modified                  = "2023-07-16T04:30:31.000+0000" -> (known after apply)%0A      ~ s3_key                         = "6961ad18-3555-c96e-0939-8b3071e5a082.zip" -> (known after apply)%0A        tags                           = {}%0A        # (21 unchanged attributes hidden)%0A%0A        # (3 unchanged blocks hidden)%0A    }%0A%0A  # module.jumphost.aws_s3_object.lambda_package must be replaced%0A-/+ resource "aws_s3_object" "lambda_package" {%0A      ~ bucket_key_enabled     = false -> (known after apply)%0A      ~ content_type           = "binary/octet-stream" -> (known after apply)%0A      ~ etag                   = "01edc3b0db6d797cc4e63d67f6aafac7-3" -> (known after apply)%0A      ~ id                     = "6961ad18-3555-c96e-0939-8b3071e5a082.zip" -> (known after apply)%0A      ~ key                    = "6961ad18-3555-c96e-0939-8b3071e5a082.zip" # forces replacement -> (known after apply) # forces replacement%0A      + kms_key_id             = (known after apply)%0A      - metadata               = {} -> null%0A      ~ server_side_encryption = "AES256" -> (known after apply)%0A      ~ source                 = "modules/jumphost/6961ad18-3555-c96e-0939-8b3071e5a082.zip" -> (known after apply)%0A      ~ storage_class          = "STANDARD" -> (known after apply)%0A      - tags                   = {} -> null%0A      + version_id             = (known after apply)%0A        # (4 unchanged attributes hidden)%0A    }%0A%0A  # module.jumphost.null_resource.install_python_dependencies must be replaced%0A-/+ resource "null_resource" "install_python_dependencies" {%0A      ~ id       = "1448941761561251015" -> (known after apply)%0A      ~ triggers = { # forces replacement%0A          ~ "main_version"         = "a3522224daf946c40355e468ae2bff48" -> "0d3dff5e338585ee6256665265c9a7c8"%0A            # (1 unchanged element hidden)%0A        }%0A    }%0A%0A  # module.jumphost.random_uuid.lamda_src_hash must be replaced%0A-/+ resource "random_uuid" "lamda_src_hash" {%0A      ~ id      = "6961ad18-3555-c96e-0939-8b3071e5a082" -> (known after apply)%0A      ~ keepers = { # forces replacement%0A          ~ "main.py"          = "a3522224daf946c40355e468ae2bff48" -> "0d3dff5e338585ee6256665265c9a7c8"%0A            # (1 unchanged element hidden)%0A        }%0A      ~ result  = "6961ad18-3555-c96e-0939-8b3071e5a082" -> (known after apply)%0A    }%0A%0APlan: 3 to add, 1 to change, 3 to destroy.%0A%0A─────────────────────────────────────────────────────────────────────────────%0A%0ASaved the plan to: tf.plan%0A%0ATo perform exactly these actions, run the following command to apply:%0A    terraform apply "tf.plan"%0AReleasing state lock. This may take a few moments...%0A
::debug::stderr: 
::debug::exitcode: 0
```
</details>
<details>
<summary>STDERR</summary>

```no output```
</details>
<details><summary><i>metadata</i></summary>
<p>
```eyJzMzovL2luZnJhaG91c2UtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0L3RlcnJhZm9ybS50ZnN0YXRlIjogeyJzdWNjZXNzIjogdHJ1ZSwgInN0ZG91dCI6ICJbY29tbWFuZF0vaG9tZS9ydW5uZXIvd29yay9fdGVtcC81YzA2YzA0Yi1iZmIzLTQ0ZTYtYWNkZS05ODI1MTZmMjllNDMvdGVycmFmb3JtLWJpbiBwbGFuIC1uby1jb2xvciAtLW91dD10Zi5wbGFuXG5tb2R1bGUuanVtcGhvc3QubnVsbF9yZXNvdXJjZS5pbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTE0NDg5NDE3NjE1NjEyNTEwMTVdXG5tb2R1bGUuanVtcGhvc3QucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTY5NjFhZDE4LTM1NTUtYzk2ZS0wOTM5LThiMzA3MWU1YTA4Ml1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbmF3c19rZXlfcGFpci5hbGVrczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YWxla3NdXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuanVtcGhvc3RfcGVybWlzc2lvbnM6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3ZwYy52cGM6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXZwYy0wOGUxOWQ4NTljMjZkMThiMl1cbmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5hd3NfczNfYnVja2V0LmxhbWJkYV90bXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtanVtcGhvc3QtbGFtYmRhLTIwMjMwNzEzMjMzNDU5Njc1ODAwMDAwMDAxXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2NhbGxlcl9pZGVudGl0eS5jdXJyZW50OiBSZWFkaW5nLi4uXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPXVzLXdlc3QtMV1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTUyMjY1MTkyXVxubW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xOTAzODQ5MzMxXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9Mzg5NDA2ODgyNl1cbmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkaW5nLi4uXG5tb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfem9uZS5pbmZyYWhvdXNlX2NvbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYXNzdW1lX3JvbGU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM2OTM0NDUwOTddXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeS5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlYWRpbmcuLi5cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDkzMzcwODI2NDI0XVxubW9kdWxlLmdpdGh1Yi1jb25uZWN0b3IuYXdzX2lhbV9vcGVuaWRfY29ubmVjdF9wcm92aWRlci5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6b2lkYy1wcm92aWRlci90b2tlbi5hY3Rpb25zLmdpdGh1YnVzZXJjb250ZW50LmNvbV1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19hbWkudWJ1bnR1XzIyOiBSZWFkaW5nLi4uXG5kYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9yb2xlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjEwMDAwMDAwMDJdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlLmlhbV9mb3JfbGFtYmRhOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYV1cbmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFtaS0wNzkzNDUyZGY4OGQzM2M2M11cbm1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3BvbGljeS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYwNDAwMDAwMDAxXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFtaS0wNzkzNDUyZGY4OGQzM2M2M11cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uXG5tb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MzkxMTg0NDg2OF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMmI0MmU3MGQ1MmE1ZGI3Zl1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMTYwMzUyNDZiNDkxMDJiNV1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmdpdGh1YjogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWdpdGh1Yl1cbm1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuanVtcGhvc3Q6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0MjAyMzA3MTAwNDMwNDQ3NjEwMDAwMDAwMDItMjAyMzA3MTAwNDMwNDU3ODExMDAwMDAwMDNdXG5tb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9pbnN0YW5jZV9wcm9maWxlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0XVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC5zcGY6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9TUEZdXG5tb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfcmVjb3JkLnR4dF9ka2ltOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfZ29vZ2xlLl9kb21haW5rZXkuaW5mcmFob3VzZS5jb21fVFhUXVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fVFhUXVxubW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC5teDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHX2luZnJhaG91c2UuY29tX01YXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZGluZy4uLlxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM4MjkzNzE2OV1cbm1vZHVsZS5qdW1waG9zdC5hd3NfbGF1bmNoX3RlbXBsYXRlLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sdC0wMWE4ZWY5NjgyMmI0YjAwYl1cbm1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uYXdzX2lhbV9yb2xlLmFkbWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW5dXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wYmM2YzQ0YzFiMjZmZWQyMl1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wY2ZmZmFjYTMyNWQ5MzgyN11cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19pbnRlcm5ldF9nYXRld2F5LmlnOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pZ3ctMDc5MDkwZTA5ZWQ1ZGI1ODJdXG5tb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9yb3V0ZV90YWJsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGQ3MzM4M2FmZWI2YWQxNDJdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGRmODg1ZGNjOTk0MTg3OTldXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGY5MWRkMjY3NWU3YTE2YzNdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDgzZTk2OWRjMzc3OWFmMjZdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wMTc4ZTE3MThkZWJhNTFjZV1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZS5hbGxbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiLTA0YTE2ZTc0ZDViMTJhMzM4XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTldXG5tb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9zZWN1cml0eV9ncm91cC5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zZy0wOGI5NjBiODVmNTk5NjEwMF1cbm1vZHVsZS5qdW1waG9zdC5hd3NfczNfYnVja2V0X3B1YmxpY19hY2Nlc3NfYmxvY2sucHVibGljX2FjY2VzczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aW5mcmFob3VzZS1qdW1waG9zdC1sYW1iZGEtMjAyMzA3MTMyMzM0NTk2NzU4MDAwMDAwMDFdXG5tb2R1bGUuanVtcGhvc3QuYXdzX3MzX29iamVjdC5sYW1iZGFfcGFja2FnZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Njk2MWFkMTgtMzU1NS1jOTZlLTA5MzktOGIzMDcxZTVhMDgyLnppcF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5kZWZhdWx0X21haW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBkNzMzODNhZmViNmFkMTQyMTA4MDI4OTQ5NF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19uYXRfZ2F0ZXdheS5uYXRfZ3dbXCIxMC4wLjIuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bmF0LTA4YjFjZDA2YjA0MzA5OWVjXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1uYXQtMDhmYjliNTI2ODMyNzc5NDddXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeS5BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMXMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L3NlcnZpY2Utcm9sZS9BV1NMYW1iZGFCYXNpY0V4ZWN1dGlvblJvbGVdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTAxNzU0MzQ4NzgwMDAwMDAwMDFdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC0yMDIzMDcxMDA0NTUxMjE2NTQwMDAwMDAwMV1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTBlNzk1YmRhZWU2MjdhYTZjXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlX2Fzc29jaWF0aW9uLnByaXZhdGVfcnRfYXNzb2NbXCIxMC4wLjMuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9cnRiYXNzb2MtMGJmMjc4YjZhMzk0YWVkNDRdXG5tb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOGE0MTAxNjBlMmRjYzU5Ml1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZV90YWJsZV9hc3NvY2lhdGlvbi5wcml2YXRlX3J0X2Fzc29jW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0YmFzc29jLTA5OWI5NThhZjE5NDg1ZjJiXVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wdWJsaWNbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9ci1ydGItMDRhMTZlNzRkNWIxMmEzMzgxMDgwMjg5NDk0XVxubW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA2N2MzMGU2NWRkNDEwOGU5MTA4MDI4OTQ5NF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHVibGljW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTBiYzZjNDRjMWIyNmZlZDIyMTA4MDI4OTQ5NF1cbm1vZHVsZS5tYW5hZ2VtZW50LmF3c19yb3V0ZS5zdWJuZXRfcHJpdmF0ZVtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wMTc4ZTE3MThkZWJhNTFjZTEwODAyODk0OTRdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9mdW5jdGlvbi51cGRhdGVfZG5zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cGRhdGVfZG5zXVxubW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19saWZlY3ljbGVfaG9vay5sYXVuY2hpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWxhdW5jaGluZ11cbm1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2sudGVybWluYXRpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXRlcm1pbmF0aW5nXVxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uXG5tb2R1bGUuanVtcGhvc3QuYXdzX2Nsb3Vkd2F0Y2hfZXZlbnRfcnVsZS5zY2FsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3Qtc2NhbGUyMDIzMDcxMTE3Mjc0NzUwNDcwMDAwMDAwMV1cbm1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYS1wZXJtaXNzaW9uczogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NTA1MjgwNDI5XVxubW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LmxhbWJkYV9wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvbGFtYmRhX3Blcm1pc3Npb25zMjAyMzA3MTExNjA1MTI3MjQyMDAwMDAwMDFdXG5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5LmFkbWluaXN0cmF0b3ItYWNjZXNzOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDJzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9BZG1pbmlzdHJhdG9yQWNjZXNzXVxubW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi0yMDIzMDcwOTE2NDMyMTMxOTkwMDAwMDAwMV1cbm1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQubGFtYmRhX3Blcm1pc3Npb25zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYS0yMDIzMDcxMTE2MDUxMzQxNjEwMDAwMDAwMl1cbm1vZHVsZS5qdW1waG9zdC5hd3NfY2xvdWR3YXRjaF9sb2dfZ3JvdXAudXBkYXRlX2RuczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9L2F3cy9sYW1iZGEvdXBkYXRlX2Ruc11cbm1vZHVsZS5qdW1waG9zdC5hd3NfY2xvdWR3YXRjaF9ldmVudF90YXJnZXQuc2NhbGUtb3V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1zY2FsZTIwMjMwNzExMTcyNzQ3NTA0NzAwMDAwMDAxLXRlcnJhZm9ybS0yMDIzMDcxMTE3Mjc0NzYzMDkwMDAwMDAwMl1cbm1vZHVsZS5qdW1waG9zdC5hd3NfbGFtYmRhX3Blcm1pc3Npb24uYWxsb3dfY2xvdWR3YXRjaDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9QWxsb3dFeGVjdXRpb25Gcm9tQ2xvdWRXYXRjaC1vdXRdXG5tb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5sYW1iZGFfbG9nZ2luZzogUmVhZGluZy4uLlxubW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhX2xvZ2dpbmc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyNjcxNDUzODJdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9wb2xpY3kubGFtYmRhX2xvZ2dpbmc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWFybjphd3M6aWFtOjo0OTMzNzA4MjY0MjQ6cG9saWN5L2xhbWJkYV9sb2dnaW5nMjAyMzA3MTExNjA1MTM3NzgzMDAwMDAwMDNdXG5tb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmxhbWJkYV9sb2dzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYS0yMDIzMDcxMTE2MDUxNDI1MTEwMDAwMDAwNF1cblxuVGVycmFmb3JtIHVzZWQgdGhlIHNlbGVjdGVkIHByb3ZpZGVycyB0byBnZW5lcmF0ZSB0aGUgZm9sbG93aW5nIGV4ZWN1dGlvblxucGxhbi4gUmVzb3VyY2UgYWN0aW9ucyBhcmUgaW5kaWNhdGVkIHdpdGggdGhlIGZvbGxvd2luZyBzeW1ib2xzOlxuICB+IHVwZGF0ZSBpbi1wbGFjZVxuLS8rIGRlc3Ryb3kgYW5kIHRoZW4gY3JlYXRlIHJlcGxhY2VtZW50XG4gPD0gcmVhZCAoZGF0YSByZXNvdXJjZXMpXG5cblRlcnJhZm9ybSB3aWxsIHBlcmZvcm0gdGhlIGZvbGxvd2luZyBhY3Rpb25zOlxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmRhdGEuYXJjaGl2ZV9maWxlLmxhbWJkYSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5XG4gICMgKGNvbmZpZyByZWZlcnMgdG8gdmFsdWVzIG5vdCB5ZXQga25vd24pXG4gPD0gZGF0YSBcImFyY2hpdmVfZmlsZVwiIFwibGFtYmRhXCIge1xuICAgICAgKyBleGNsdWRlcyAgICAgICAgICAgID0gW1xuICAgICAgICAgICsgXCJfX3B5Y2FjaGVfX1wiLFxuICAgICAgICBdXG4gICAgICArIGlkICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9iYXNlNjRzaGEyNTYgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9iYXNlNjRzaGE1MTIgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9tZDUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9wYXRoICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9zaGEgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9zaGEyNTYgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9zaGE1MTIgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIG91dHB1dF9zaXplICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICArIHNvdXJjZV9kaXIgICAgICAgICAgPSBcIm1vZHVsZXMvanVtcGhvc3QvdXBkYXRlX2Ruc1wiXG4gICAgICArIHR5cGUgICAgICAgICAgICAgICAgPSBcInppcFwiXG4gICAgfVxuXG4gICMgbW9kdWxlLmp1bXBob3N0LmF3c19sYW1iZGFfZnVuY3Rpb24udXBkYXRlX2RucyB3aWxsIGJlIHVwZGF0ZWQgaW4tcGxhY2VcbiAgfiByZXNvdXJjZSBcImF3c19sYW1iZGFfZnVuY3Rpb25cIiBcInVwZGF0ZV9kbnNcIiB7XG4gICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidXBkYXRlX2Ruc1wiXG4gICAgICB+IGxhc3RfbW9kaWZpZWQgICAgICAgICAgICAgICAgICA9IFwiMjAyMy0wNy0xNlQwNDozMDozMS4wMDArMDAwMFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gczNfa2V5ICAgICAgICAgICAgICAgICAgICAgICAgID0gXCI2OTYxYWQxOC0zNTU1LWM5NmUtMDkzOS04YjMwNzFlNWEwODIuemlwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7fVxuICAgICAgICAjICgyMSB1bmNoYW5nZWQgYXR0cmlidXRlcyBoaWRkZW4pXG5cbiAgICAgICAgIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX3MzX29iamVjdC5sYW1iZGFfcGFja2FnZSBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJhd3NfczNfb2JqZWN0XCIgXCJsYW1iZGFfcGFja2FnZVwiIHtcbiAgICAgIH4gYnVja2V0X2tleV9lbmFibGVkICAgICA9IGZhbHNlIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gY29udGVudF90eXBlICAgICAgICAgICA9IFwiYmluYXJ5L29jdGV0LXN0cmVhbVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gZXRhZyAgICAgICAgICAgICAgICAgICA9IFwiMDFlZGMzYjBkYjZkNzk3Y2M0ZTYzZDY3ZjZhYWZhYzctM1wiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gaWQgICAgICAgICAgICAgICAgICAgICA9IFwiNjk2MWFkMTgtMzU1NS1jOTZlLTA5MzktOGIzMDcxZTVhMDgyLnppcFwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4ga2V5ICAgICAgICAgICAgICAgICAgICA9IFwiNjk2MWFkMTgtMzU1NS1jOTZlLTA5MzktOGIzMDcxZTVhMDgyLnppcFwiICMgZm9yY2VzIHJlcGxhY2VtZW50IC0+IChrbm93biBhZnRlciBhcHBseSkgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgICsga21zX2tleV9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIC0gbWV0YWRhdGEgICAgICAgICAgICAgICA9IHt9IC0+IG51bGxcbiAgICAgIH4gc2VydmVyX3NpZGVfZW5jcnlwdGlvbiA9IFwiQUVTMjU2XCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgfiBzb3VyY2UgICAgICAgICAgICAgICAgID0gXCJtb2R1bGVzL2p1bXBob3N0LzY5NjFhZDE4LTM1NTUtYzk2ZS0wOTM5LThiMzA3MWU1YTA4Mi56aXBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpXG4gICAgICB+IHN0b3JhZ2VfY2xhc3MgICAgICAgICAgPSBcIlNUQU5EQVJEXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgID0ge30gLT4gbnVsbFxuICAgICAgKyB2ZXJzaW9uX2lkICAgICAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgICAgICAjICg0IHVuY2hhbmdlZCBhdHRyaWJ1dGVzIGhpZGRlbilcbiAgICB9XG5cbiAgIyBtb2R1bGUuanVtcGhvc3QubnVsbF9yZXNvdXJjZS5pbnN0YWxsX3B5dGhvbl9kZXBlbmRlbmNpZXMgbXVzdCBiZSByZXBsYWNlZFxuLS8rIHJlc291cmNlIFwibnVsbF9yZXNvdXJjZVwiIFwiaW5zdGFsbF9weXRob25fZGVwZW5kZW5jaWVzXCIge1xuICAgICAgfiBpZCAgICAgICA9IFwiMTQ0ODk0MTc2MTU2MTI1MTAxNVwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4gdHJpZ2dlcnMgPSB7ICMgZm9yY2VzIHJlcGxhY2VtZW50XG4gICAgICAgICAgfiBcIm1haW5fdmVyc2lvblwiICAgICAgICAgPSBcImEzNTIyMjI0ZGFmOTQ2YzQwMzU1ZTQ2OGFlMmJmZjQ4XCIgLT4gXCIwZDNkZmY1ZTMzODU4NWVlNjI1NjY2NTI2NWM5YTdjOFwiXG4gICAgICAgICAgICAjICgxIHVuY2hhbmdlZCBlbGVtZW50IGhpZGRlbilcbiAgICAgICAgfVxuICAgIH1cblxuICAjIG1vZHVsZS5qdW1waG9zdC5yYW5kb21fdXVpZC5sYW1kYV9zcmNfaGFzaCBtdXN0IGJlIHJlcGxhY2VkXG4tLysgcmVzb3VyY2UgXCJyYW5kb21fdXVpZFwiIFwibGFtZGFfc3JjX2hhc2hcIiB7XG4gICAgICB+IGlkICAgICAgPSBcIjY5NjFhZDE4LTM1NTUtYzk2ZS0wOTM5LThiMzA3MWU1YTA4MlwiIC0+IChrbm93biBhZnRlciBhcHBseSlcbiAgICAgIH4ga2VlcGVycyA9IHsgIyBmb3JjZXMgcmVwbGFjZW1lbnRcbiAgICAgICAgICB+IFwibWFpbi5weVwiICAgICAgICAgID0gXCJhMzUyMjIyNGRhZjk0NmM0MDM1NWU0NjhhZTJiZmY0OFwiIC0+IFwiMGQzZGZmNWUzMzg1ODVlZTYyNTY2NjUyNjVjOWE3YzhcIlxuICAgICAgICAgICAgIyAoMSB1bmNoYW5nZWQgZWxlbWVudCBoaWRkZW4pXG4gICAgICAgIH1cbiAgICAgIH4gcmVzdWx0ICA9IFwiNjk2MWFkMTgtMzU1NS1jOTZlLTA5MzktOGIzMDcxZTVhMDgyXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KVxuICAgIH1cblxuUGxhbjogMyB0byBhZGQsIDEgdG8gY2hhbmdlLCAzIHRvIGRlc3Ryb3kuXG5cblx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFx1MjUwMFxuXG5TYXZlZCB0aGUgcGxhbiB0bzogdGYucGxhblxuXG5UbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTpcbiAgICB0ZXJyYWZvcm0gYXBwbHkgXCJ0Zi5wbGFuXCJcblJlbGVhc2luZyBzdGF0ZSBsb2NrLiBUaGlzIG1heSB0YWtlIGEgZmV3IG1vbWVudHMuLi5cbjo6ZGVidWc6OlRlcnJhZm9ybSBleGl0ZWQgd2l0aCBjb2RlIDAuXG46OmRlYnVnOjpzdGRvdXQ6IG1vZHVsZS5qdW1waG9zdC5udWxsX3Jlc291cmNlLmluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9MTQ0ODk0MTc2MTU2MTI1MTAxNV0lMEFtb2R1bGUuanVtcGhvc3QucmFuZG9tX3V1aWQubGFtZGFfc3JjX2hhc2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPTY5NjFhZDE4LTM1NTUtYzk2ZS0wOTM5LThiMzA3MWU1YTA4Ml0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBYXdzX2tleV9wYWlyLmFsZWtzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hbGVrc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfcmVnaW9uLmN1cnJlbnQ6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5qdW1waG9zdF9wZXJtaXNzaW9uczogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZGluZy4uLiUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c192cGMudnBjOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD12cGMtMDhlMTlkODU5YzI2ZDE4YjJdJTBBZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5hd3NfczNfYnVja2V0LmxhbWJkYV90bXA6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWluZnJhaG91c2UtanVtcGhvc3QtbGFtYmRhLTIwMjMwNzEzMjMzNDU5Njc1ODAwMDAwMDAxXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19yZWdpb24uY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9dXMtd2VzdC0xXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50Lmp1bXBob3N0X3Blcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0xMTUyMjY1MTkyXSUwQW1vZHVsZS5qdW1waG9zdC5tb2R1bGUuanVtcGhvc3RfcHJvZmlsZS5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTkwMzg0OTMzMV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuZ2l0aHViLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zODk0MDY4ODI2XSUwQWRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWRpbmcuLi4lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5hc3N1bWVfcm9sZTogUmVhZGluZy4uLiUwQWRhdGEuYXdzX2F2YWlsYWJpbGl0eV96b25lcy51dzE6IFJlYWRpbmcuLi4lMEFtb2R1bGUuaW5mcmFob3VzZV9jb20uYXdzX3JvdXRlNTNfem9uZS5pbmZyYWhvdXNlX2NvbTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9WjA3NjYyMjUxTEgzWVJGMkVSTTNHXSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFzc3VtZV9yb2xlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD0zNjkzNDQ1MDk3XSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5LkFXU0xhbWJkYUJhc2ljRXhlY3V0aW9uUm9sZTogUmVhZGluZy4uLiUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19jYWxsZXJfaWRlbnRpdHkuY3VycmVudDogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9NDkzMzcwODI2NDI0XSUwQW1vZHVsZS5naXRodWItY29ubmVjdG9yLmF3c19pYW1fb3BlbmlkX2Nvbm5lY3RfcHJvdmlkZXIuZ2l0aHViOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0Om9pZGMtcHJvdmlkZXIvdG9rZW4uYWN0aW9ucy5naXRodWJ1c2VyY29udGVudC5jb21dJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWRpbmcuLi4lMEFkYXRhLmF3c19hdmFpbGFiaWxpdHlfem9uZXMudXcxOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD11cy13ZXN0LTFdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZS5wcm9maWxlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdDIwMjMwNzEwMDQzMDQ0NzYxMDAwMDAwMDAyXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3JvbGUuaWFtX2Zvcl9sYW1iZGE6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlhbV9mb3JfbGFtYmRhXSUwQWRhdGEuYXdzX2FtaS51YnVudHVfMjI6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPWFtaS0wNzkzNDUyZGY4OGQzM2M2M10lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9wb2xpY3kucHJvZmlsZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvanVtcGhvc3QyMDIzMDcxMDA0MzA0NDc2MDQwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuZGF0YS5hd3NfYW1pLnVidW50dV8yMjogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9YW1pLTA3OTM0NTJkZjg4ZDMzYzYzXSUwQW1vZHVsZS5paC10Zi1hd3MtY29udHJvbC00OTMzNzA4MjY0MjQtYWRtaW4uZGF0YS5hd3NfaWFtX3BvbGljeV9kb2N1bWVudC5naXRodWItYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmdpdGh1Yi1hc3N1bWU6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTM5MTE4NDQ4NjhdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2VpcC5uYXRfZWlwW1wiMTAuMC4wLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWVpcGFsbG9jLTAyYjQyZTcwZDUyYTVkYjdmXSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19laXAubmF0X2VpcFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1laXBhbGxvYy0wMTYwMzUyNDZiNDkxMDJiNV0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmF3c19pYW1fcm9sZS5naXRodWI6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1naXRodWJdJTBBbW9kdWxlLmp1bXBob3N0Lm1vZHVsZS5qdW1waG9zdF9wcm9maWxlLmF3c19pYW1fcm9sZV9wb2xpY3lfYXR0YWNobWVudC5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9anVtcGhvc3QyMDIzMDcxMDA0MzA0NDc2MTAwMDAwMDAwMi0yMDIzMDcxMDA0MzA0NTc4MTEwMDAwMDAwM10lMEFtb2R1bGUuanVtcGhvc3QubW9kdWxlLmp1bXBob3N0X3Byb2ZpbGUuYXdzX2lhbV9pbnN0YW5jZV9wcm9maWxlLnByb2ZpbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0XSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQuc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fU1BGXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQudHh0X2RraW06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19nb29nbGUuX2RvbWFpbmtleS5pbmZyYWhvdXNlLmNvbV9UWFRdJTBBbW9kdWxlLmluZnJhaG91c2VfY29tLmF3c19yb3V0ZTUzX3JlY29yZC50eHRfc3BmOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1aMDc2NjIyNTFMSDNZUkYyRVJNM0dfaW5mcmFob3VzZS5jb21fVFhUXSUwQW1vZHVsZS5pbmZyYWhvdXNlX2NvbS5hd3Nfcm91dGU1M19yZWNvcmQubXg6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPVowNzY2MjI1MUxIM1lSRjJFUk0zR19pbmZyYWhvdXNlLmNvbV9NWF0lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQuYWRtaW4tYXNzdW1lOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmFkbWluLWFzc3VtZTogUmVhZCBjb21wbGV0ZSBhZnRlciAwcyBbaWQ9MTM4MjkzNzE2OV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xhdW5jaF90ZW1wbGF0ZS5qdW1waG9zdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9bHQtMDFhOGVmOTY4MjJiNGIwMGJdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGUuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGUuYWxsW1wiMTAuMC4yLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXJ0Yi0wYmM2YzQ0YzFiMjZmZWQyMl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMGNmZmZhY2EzMjVkOTM4MjddJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2ludGVybmV0X2dhdGV3YXkuaWc6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlndy0wNzkwOTBlMDllZDVkYjU4Ml0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3NfZGVmYXVsdF9yb3V0ZV90YWJsZS5kZWZhdWx0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMGQ3MzM4M2FmZWI2YWQxNDJdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3N1Ym5ldC5hbGxbXCIxMC4wLjAuMC8yNFwiXTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c3VibmV0LTBkZjg4NWRjYzk5NDE4Nzk5XSUwQW1vZHVsZS5tYW5hZ2VtZW50LmF3c19zdWJuZXQuYWxsW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXN1Ym5ldC0wZjkxZGQyNjc1ZTdhMTZjM10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfc3VibmV0LmFsbFtcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1zdWJuZXQtMDgzZTk2OWRjMzc3OWFmMjZdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDE3OGUxNzE4ZGViYTUxY2VdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDRhMTZlNzRkNWIxMmEzMzhdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlX3RhYmxlLmFsbFtcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGItMDY3YzMwZTY1ZGQ0MTA4ZTldJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX2RlZmF1bHRfc2VjdXJpdHlfZ3JvdXAuZGVmYXVsdDogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9c2ctMDhiOTYwYjg1ZjU5OTYxMDBdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19zM19idWNrZXRfcHVibGljX2FjY2Vzc19ibG9jay5wdWJsaWNfYWNjZXNzOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pbmZyYWhvdXNlLWp1bXBob3N0LWxhbWJkYS0yMDIzMDcxMzIzMzQ1OTY3NTgwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX3MzX29iamVjdC5sYW1iZGFfcGFja2FnZTogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9Njk2MWFkMTgtMzU1NS1jOTZlLTA5MzktOGIzMDcxZTVhMDgyLnppcF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuZGVmYXVsdF9tYWluOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wZDczMzgzYWZlYjZhZDE0MjEwODAyODk0OTRdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1uYXQtMDhiMWNkMDZiMDQzMDk5ZWNdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX25hdF9nYXRld2F5Lm5hdF9nd1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1uYXQtMDhmYjliNTI2ODMyNzc5NDddJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3kuQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDFzIFtpZD1hcm46YXdzOmlhbTo6YXdzOnBvbGljeS9zZXJ2aWNlLXJvbGUvQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuQVdTTGFtYmRhQmFzaWNFeGVjdXRpb25Sb2xlOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1pYW1fZm9yX2xhbWJkYS0yMDIzMDcxMDE3NTQzNDg3ODAwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2F1dG9zY2FsaW5nX2dyb3VwLmp1bXBob3N0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC0yMDIzMDcxMDA0NTUxMjE2NTQwMDAwMDAwMV0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wZTc5NWJkYWVlNjI3YWE2Y10lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMy4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wYmYyNzhiNmEzOTRhZWQ0NF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOGE0MTAxNjBlMmRjYzU5Ml0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGVfdGFibGVfYXNzb2NpYXRpb24ucHJpdmF0ZV9ydF9hc3NvY1tcIjEwLjAuMS4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1ydGJhc3NvYy0wOTliOTU4YWYxOTQ4NWYyYl0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMC4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wNGExNmU3NGQ1YjEyYTMzODEwODAyODk0OTRdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC4xLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTA2N2MzMGU2NWRkNDEwOGU5MTA4MDI4OTQ5NF0lMEFtb2R1bGUubWFuYWdlbWVudC5hd3Nfcm91dGUuc3VibmV0X3B1YmxpY1tcIjEwLjAuMi4wLzI0XCJdOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1yLXJ0Yi0wYmM2YzQ0YzFiMjZmZWQyMjEwODAyODk0OTRdJTBBbW9kdWxlLm1hbmFnZW1lbnQuYXdzX3JvdXRlLnN1Ym5ldF9wcml2YXRlW1wiMTAuMC4zLjAvMjRcIl06IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPXItcnRiLTAxNzhlMTcxOGRlYmE1MWNlMTA4MDI4OTQ5NF0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9mdW5jdGlvbi51cGRhdGVfZG5zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD11cGRhdGVfZG5zXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfYXV0b3NjYWxpbmdfbGlmZWN5Y2xlX2hvb2subGF1bmNoaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1sYXVuY2hpbmddJTBBbW9kdWxlLmp1bXBob3N0LmF3c19hdXRvc2NhbGluZ19saWZlY3ljbGVfaG9vay50ZXJtaW5hdGluZzogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9dGVybWluYXRpbmddJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhLXBlcm1pc3Npb25zOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmF3c19jbG91ZHdhdGNoX2V2ZW50X3J1bGUuc2NhbGU6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWp1bXBob3N0LXNjYWxlMjAyMzA3MTExNzI3NDc1MDQ3MDAwMDAwMDFdJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhLXBlcm1pc3Npb25zOiBSZWFkIGNvbXBsZXRlIGFmdGVyIDBzIFtpZD01MDUyODA0MjldJTBBbW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LmxhbWJkYV9wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9YXJuOmF3czppYW06OjQ5MzM3MDgyNjQyNDpwb2xpY3kvbGFtYmRhX3Blcm1pc3Npb25zMjAyMzA3MTExNjA1MTI3MjQyMDAwMDAwMDFdJTBBZGF0YS5hd3NfaWFtX3BvbGljeS5hZG1pbmlzdHJhdG9yLWFjY2VzczogUmVhZCBjb21wbGV0ZSBhZnRlciAycyBbaWQ9YXJuOmF3czppYW06OmF3czpwb2xpY3kvQWRtaW5pc3RyYXRvckFjY2Vzc10lMEFtb2R1bGUuaWgtdGYtYXdzLWNvbnRyb2wtNDkzMzcwODI2NDI0LWFkbWluLmRhdGEuYXdzX2lhbV9wb2xpY3kuYWRtaW5pc3RyYXRvci1hY2Nlc3M6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMnMgW2lkPWFybjphd3M6aWFtOjphd3M6cG9saWN5L0FkbWluaXN0cmF0b3JBY2Nlc3NdJTBBbW9kdWxlLmloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQuYWRtaW46IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWloLXRmLWF3cy1jb250cm9sLTQ5MzM3MDgyNjQyNC1hZG1pbi0yMDIzMDcwOTE2NDMyMTMxOTkwMDAwMDAwMV0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2lhbV9yb2xlX3BvbGljeV9hdHRhY2htZW50LmxhbWJkYV9wZXJtaXNzaW9uczogUmVmcmVzaGluZyBzdGF0ZS4uLiBbaWQ9aWFtX2Zvcl9sYW1iZGEtMjAyMzA3MTExNjA1MTM0MTYxMDAwMDAwMDJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19jbG91ZHdhdGNoX2xvZ19ncm91cC51cGRhdGVfZG5zOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD0vYXdzL2xhbWJkYS91cGRhdGVfZG5zXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfY2xvdWR3YXRjaF9ldmVudF90YXJnZXQuc2NhbGUtb3V0OiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1qdW1waG9zdC1zY2FsZTIwMjMwNzExMTcyNzQ3NTA0NzAwMDAwMDAxLXRlcnJhZm9ybS0yMDIzMDcxMTE3Mjc0NzYzMDkwMDAwMDAwMl0lMEFtb2R1bGUuanVtcGhvc3QuYXdzX2xhbWJkYV9wZXJtaXNzaW9uLmFsbG93X2Nsb3Vkd2F0Y2g6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPUFsbG93RXhlY3V0aW9uRnJvbUNsb3VkV2F0Y2gtb3V0XSUwQW1vZHVsZS5qdW1waG9zdC5kYXRhLmF3c19pYW1fcG9saWN5X2RvY3VtZW50LmxhbWJkYV9sb2dnaW5nOiBSZWFkaW5nLi4uJTBBbW9kdWxlLmp1bXBob3N0LmRhdGEuYXdzX2lhbV9wb2xpY3lfZG9jdW1lbnQubGFtYmRhX2xvZ2dpbmc6IFJlYWQgY29tcGxldGUgYWZ0ZXIgMHMgW2lkPTIyNjcxNDUzODJdJTBBbW9kdWxlLmp1bXBob3N0LmF3c19pYW1fcG9saWN5LmxhbWJkYV9sb2dnaW5nOiBSZWZyZXNoaW5nIHN0YXRlLi4uIFtpZD1hcm46YXdzOmlhbTo6NDkzMzcwODI2NDI0OnBvbGljeS9sYW1iZGFfbG9nZ2luZzIwMjMwNzExMTYwNTEzNzc4MzAwMDAwMDAzXSUwQW1vZHVsZS5qdW1waG9zdC5hd3NfaWFtX3JvbGVfcG9saWN5X2F0dGFjaG1lbnQubGFtYmRhX2xvZ3M6IFJlZnJlc2hpbmcgc3RhdGUuLi4gW2lkPWlhbV9mb3JfbGFtYmRhLTIwMjMwNzExMTYwNTE0MjUxMTAwMDAwMDA0XSUwQSUwQVRlcnJhZm9ybSB1c2VkIHRoZSBzZWxlY3RlZCBwcm92aWRlcnMgdG8gZ2VuZXJhdGUgdGhlIGZvbGxvd2luZyBleGVjdXRpb24lMEFwbGFuLiBSZXNvdXJjZSBhY3Rpb25zIGFyZSBpbmRpY2F0ZWQgd2l0aCB0aGUgZm9sbG93aW5nIHN5bWJvbHM6JTBBICB+IHVwZGF0ZSBpbi1wbGFjZSUwQS0vKyBkZXN0cm95IGFuZCB0aGVuIGNyZWF0ZSByZXBsYWNlbWVudCUwQSA8PSByZWFkIChkYXRhIHJlc291cmNlcyklMEElMEFUZXJyYWZvcm0gd2lsbCBwZXJmb3JtIHRoZSBmb2xsb3dpbmcgYWN0aW9uczolMEElMEEgICMgbW9kdWxlLmp1bXBob3N0LmRhdGEuYXJjaGl2ZV9maWxlLmxhbWJkYSB3aWxsIGJlIHJlYWQgZHVyaW5nIGFwcGx5JTBBICAjIChjb25maWcgcmVmZXJzIHRvIHZhbHVlcyBub3QgeWV0IGtub3duKSUwQSA8PSBkYXRhIFwiYXJjaGl2ZV9maWxlXCIgXCJsYW1iZGFcIiB7JTBBICAgICAgKyBleGNsdWRlcyAgICAgICAgICAgID0gWyUwQSAgICAgICAgICArIFwiX19weWNhY2hlX19cIiwlMEEgICAgICAgIF0lMEEgICAgICArIGlkICAgICAgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfYmFzZTY0c2hhMjU2ID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X2Jhc2U2NHNoYTUxMiA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9tZDUgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfcGF0aCAgICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X3NoYSAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIG91dHB1dF9zaGEyNTYgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgKyBvdXRwdXRfc2hhNTEyICAgICAgID0gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgICsgb3V0cHV0X3NpemUgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICArIHNvdXJjZV9kaXIgICAgICAgICAgPSBcIm1vZHVsZXMvanVtcGhvc3QvdXBkYXRlX2Ruc1wiJTBBICAgICAgKyB0eXBlICAgICAgICAgICAgICAgID0gXCJ6aXBcIiUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5hd3NfbGFtYmRhX2Z1bmN0aW9uLnVwZGF0ZV9kbnMgd2lsbCBiZSB1cGRhdGVkIGluLXBsYWNlJTBBICB+IHJlc291cmNlIFwiYXdzX2xhbWJkYV9mdW5jdGlvblwiIFwidXBkYXRlX2Ruc1wiIHslMEEgICAgICAgIGlkICAgICAgICAgICAgICAgICAgICAgICAgICAgICA9IFwidXBkYXRlX2Ruc1wiJTBBICAgICAgfiBsYXN0X21vZGlmaWVkICAgICAgICAgICAgICAgICAgPSBcIjIwMjMtMDctMTZUMDQ6MzA6MzEuMDAwKzAwMDBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBzM19rZXkgICAgICAgICAgICAgICAgICAgICAgICAgPSBcIjY5NjFhZDE4LTM1NTUtYzk2ZS0wOTM5LThiMzA3MWU1YTA4Mi56aXBcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgICB0YWdzICAgICAgICAgICAgICAgICAgICAgICAgICAgPSB7fSUwQSAgICAgICAgIyAoMjEgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSUwQSAgICAgICAgIyAoMyB1bmNoYW5nZWQgYmxvY2tzIGhpZGRlbiklMEEgICAgfSUwQSUwQSAgIyBtb2R1bGUuanVtcGhvc3QuYXdzX3MzX29iamVjdC5sYW1iZGFfcGFja2FnZSBtdXN0IGJlIHJlcGxhY2VkJTBBLS8rIHJlc291cmNlIFwiYXdzX3MzX29iamVjdFwiIFwibGFtYmRhX3BhY2thZ2VcIiB7JTBBICAgICAgfiBidWNrZXRfa2V5X2VuYWJsZWQgICAgID0gZmFsc2UgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gY29udGVudF90eXBlICAgICAgICAgICA9IFwiYmluYXJ5L29jdGV0LXN0cmVhbVwiIC0+IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICB+IGV0YWcgICAgICAgICAgICAgICAgICAgPSBcIjAxZWRjM2IwZGI2ZDc5N2NjNGU2M2Q2N2Y2YWFmYWM3LTNcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBpZCAgICAgICAgICAgICAgICAgICAgID0gXCI2OTYxYWQxOC0zNTU1LWM5NmUtMDkzOS04YjMwNzFlNWEwODIuemlwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4ga2V5ICAgICAgICAgICAgICAgICAgICA9IFwiNjk2MWFkMTgtMzU1NS1jOTZlLTA5MzktOGIzMDcxZTVhMDgyLnppcFwiICMgZm9yY2VzIHJlcGxhY2VtZW50IC0+IChrbm93biBhZnRlciBhcHBseSkgIyBmb3JjZXMgcmVwbGFjZW1lbnQlMEEgICAgICArIGttc19rZXlfaWQgICAgICAgICAgICAgPSAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgLSBtZXRhZGF0YSAgICAgICAgICAgICAgID0ge30gLT4gbnVsbCUwQSAgICAgIH4gc2VydmVyX3NpZGVfZW5jcnlwdGlvbiA9IFwiQUVTMjU2XCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gc291cmNlICAgICAgICAgICAgICAgICA9IFwibW9kdWxlcy9qdW1waG9zdC82OTYxYWQxOC0zNTU1LWM5NmUtMDkzOS04YjMwNzFlNWEwODIuemlwXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICAgIH4gc3RvcmFnZV9jbGFzcyAgICAgICAgICA9IFwiU1RBTkRBUkRcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgLSB0YWdzICAgICAgICAgICAgICAgICAgID0ge30gLT4gbnVsbCUwQSAgICAgICsgdmVyc2lvbl9pZCAgICAgICAgICAgICA9IChrbm93biBhZnRlciBhcHBseSklMEEgICAgICAgICMgKDQgdW5jaGFuZ2VkIGF0dHJpYnV0ZXMgaGlkZGVuKSUwQSAgICB9JTBBJTBBICAjIG1vZHVsZS5qdW1waG9zdC5udWxsX3Jlc291cmNlLmluc3RhbGxfcHl0aG9uX2RlcGVuZGVuY2llcyBtdXN0IGJlIHJlcGxhY2VkJTBBLS8rIHJlc291cmNlIFwibnVsbF9yZXNvdXJjZVwiIFwiaW5zdGFsbF9weXRob25fZGVwZW5kZW5jaWVzXCIgeyUwQSAgICAgIH4gaWQgICAgICAgPSBcIjE0NDg5NDE3NjE1NjEyNTEwMTVcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiB0cmlnZ2VycyA9IHsgIyBmb3JjZXMgcmVwbGFjZW1lbnQlMEEgICAgICAgICAgfiBcIm1haW5fdmVyc2lvblwiICAgICAgICAgPSBcImEzNTIyMjI0ZGFmOTQ2YzQwMzU1ZTQ2OGFlMmJmZjQ4XCIgLT4gXCIwZDNkZmY1ZTMzODU4NWVlNjI1NjY2NTI2NWM5YTdjOFwiJTBBICAgICAgICAgICAgIyAoMSB1bmNoYW5nZWQgZWxlbWVudCBoaWRkZW4pJTBBICAgICAgICB9JTBBICAgIH0lMEElMEEgICMgbW9kdWxlLmp1bXBob3N0LnJhbmRvbV91dWlkLmxhbWRhX3NyY19oYXNoIG11c3QgYmUgcmVwbGFjZWQlMEEtLysgcmVzb3VyY2UgXCJyYW5kb21fdXVpZFwiIFwibGFtZGFfc3JjX2hhc2hcIiB7JTBBICAgICAgfiBpZCAgICAgID0gXCI2OTYxYWQxOC0zNTU1LWM5NmUtMDkzOS04YjMwNzFlNWEwODJcIiAtPiAoa25vd24gYWZ0ZXIgYXBwbHkpJTBBICAgICAgfiBrZWVwZXJzID0geyAjIGZvcmNlcyByZXBsYWNlbWVudCUwQSAgICAgICAgICB+IFwibWFpbi5weVwiICAgICAgICAgID0gXCJhMzUyMjIyNGRhZjk0NmM0MDM1NWU0NjhhZTJiZmY0OFwiIC0+IFwiMGQzZGZmNWUzMzg1ODVlZTYyNTY2NjUyNjVjOWE3YzhcIiUwQSAgICAgICAgICAgICMgKDEgdW5jaGFuZ2VkIGVsZW1lbnQgaGlkZGVuKSUwQSAgICAgICAgfSUwQSAgICAgIH4gcmVzdWx0ICA9IFwiNjk2MWFkMTgtMzU1NS1jOTZlLTA5MzktOGIzMDcxZTVhMDgyXCIgLT4gKGtub3duIGFmdGVyIGFwcGx5KSUwQSAgICB9JTBBJTBBUGxhbjogMyB0byBhZGQsIDEgdG8gY2hhbmdlLCAzIHRvIGRlc3Ryb3kuJTBBJTBBXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwXHUyNTAwJTBBJTBBU2F2ZWQgdGhlIHBsYW4gdG86IHRmLnBsYW4lMEElMEFUbyBwZXJmb3JtIGV4YWN0bHkgdGhlc2UgYWN0aW9ucywgcnVuIHRoZSBmb2xsb3dpbmcgY29tbWFuZCB0byBhcHBseTolMEEgICAgdGVycmFmb3JtIGFwcGx5IFwidGYucGxhblwiJTBBUmVsZWFzaW5nIHN0YXRlIGxvY2suIFRoaXMgbWF5IHRha2UgYSBmZXcgbW9tZW50cy4uLiUwQVxuOjpkZWJ1Zzo6c3RkZXJyOiBcbjo6ZGVidWc6OmV4aXRjb2RlOiAwXG4iLCAic3RkZXJyIjogIiIsICJhZGQiOiAzLCAiY2hhbmdlIjogMSwgImRlc3Ryb3kiOiAzfX0=```
</p></details>